app/views/debts/_form.html.erb

    <%= f.label :debitor_id %><br />
    <%= f.collection_select :debitor_id, User.where("id !=" + current_user.id.to_s), :id, :nickname, { selected: @debt.debitor_id}, { multiple: false } %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1