app/views/debts/_form.html.erb

    <%= f.label :debitor_id %><br />
    <%= f.collection_select :debitor_id, User.all, :id, :nickname, { selected: @debt.debitor_id}, { multiple: false } %>
---
SELECT "users".* FROM "users"