app/views/debts/index.html.erb


	<% Debt.where('creditor_id = ? or debitor_id =?',current_user.id,current_user.id).each do |debt| %>
---
SELECT creditor_id as user_id FROM "debts" WHERE "debts"."user_id" = 3

    <td><%= debt.description %></td>
    <td><%= User.find(debt.debitor_id).nickname %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1