app/controllers/debts_controller.rb

SELECT "debts".* FROM "debts" WHERE (creditor_id = 3 or debitor_id =3)
---
  def index
    if current_user
    	@debts = Debt.paginate(:page => params[:page], :per_page => 10)

SELECT "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT 1  [["id", "users"]]
---
  def show
    #@debt = Debt.find(params[:id])

	@dollar = (Exchange.find(1).value * Debt.find(params[:id]).value).round(2)

INSERT INTO "debts" ("bill", "bill_type", "cleared", "confirmed", "created_at", "creditor_id", "debitor_id", "description", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @debt = Debt.new(params[:debt])

    respond_to do |format|
      if @debt.save

SELECT "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "debts" SET "value" = 5.5, "description" = 'Dinner', "updated_at" = '2013-01-12 22:04:02.150524' WHERE "debts"."id" = 1
---
  def update
    @debt = Debt.find(params[:id])

    respond_to do |format|
      if @debt.update_attributes(params[:debt])

SELECT "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "debts" WHERE "debts"."id" = ?  [["id", 1]]
---
  def destroy
    @debt = Debt.find(params[:id])
    @debt.destroy